#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cd-testing/cd-testing/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cd-testing/cd-testing

To view this run in a browser, visit:
https://app.terraform.io/app/kautomate/clidriven/runs/run-bwN6NRSc7jm7pad2

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
random_id.server_PR_3: Refreshing state... [id=bLqRFnAFutg]
random_id.server: Refreshing state... [id=xQu9mPUSTwg]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]
aws_security_group.this: Refreshing state... [id=sg-02ff6a500fc7654b8]
aws_instance.staging_cicd_demo: Refreshing state... [id=i-0572795a752ea404e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo_PR_3 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_3" {
      + ami                                  = "ami-0c1c30571d2dae5c9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_3"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_3"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0d2411db69a112a30",
        ]
    }

  # aws_security_group.this will be destroyed
  # (because aws_security_group.this is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:eu-west-1:058264079048:security-group/sg-02ff6a500fc7654b8" -> null
      - description            = "ssh and https" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-02ff6a500fc7654b8" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "ssh-https" -> null
      - owner_id               = "058264079048" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-01c0cd4d7700ba67f" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + staging_dns_PR_3 = (known after apply)

```

</details>

*Pusher: @KiranChilledOut, Action: `workflow_dispatch`*